app/views/books/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 5]]
---
<hr><h2>Posted Reviews</h2><hr>
<% @book.reviews.each do |review| %>