app/controllers/books_controller.rb

    def index
       @book = Book.all
---
SELECT "books".* FROM "books"

    def create
       @book = Book.new(params.require(:book).permit(:book_name,:description,:published_date,:image))
       if @book.save
---
INSERT INTO "books" ("book_name", "description", "published_date", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

   def update
        @book = Book.find(params[:id])
       if @book.update(params.require(:book).permit(:book_name,:description,:published_date,:image))
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "book_name" = ?, "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["book_name", "chemistry"], ["description", "chemistry exception"], ["updated_at", "2023-01-12 14:49:05.681331"], ["id", 4]]

   def destroy
        @book = Book.find(params[:id])
       @book.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]