app/controllers/reviews_controller.rb

        def create
          @book = Book.find(params[:book_id])
          @review = @book.reviews.create(review_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("r_name", "r_desc", "star", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["r_name", "s;kdmf"], ["r_desc", "sldknvs"], ["star", nil], ["book_id", 2], ["created_at", "2023-01-11 21:29:03.601223"], ["updated_at", "2023-01-11 21:29:03.601223"]]